# IFCFileReadOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileReadOptions Constructor
IFCFileReadOptions Class See Also
---
Creates a default IFCFileReadOptions.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IFCFileReadOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCFileReadOptions()
```

# See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace